Revit 2027 API
Hardwood.HardwoodFinish Property
 The property labeled "Finish" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string HardwoodFinish { get; }
Public Shared ReadOnly Property HardwoodFinish As String
	Get
public:
static property String^ HardwoodFinish {
	String^ get ();
}
static member HardwoodFinish : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodFinishType".
See Also
Reference
Hardwood Class
Autodesk.Revit.DB.Visual Namespace